import z from "zod";
import { type Buff } from "./buff";
export declare const EQUIPMENT_TYPE: {
    readonly shields: "shields";
    readonly weapons: "weapons";
    readonly defences: "defences";
};
export declare const equipmentTypeSchema: z.ZodUnion<[z.ZodLiteral<"shields">, z.ZodLiteral<"weapons">, z.ZodLiteral<"defences">]>;
export type EquipmentType = (typeof EQUIPMENT_TYPE)[keyof typeof EQUIPMENT_TYPE];
export declare const DEFENCE_PARTS: readonly [z.ZodLiteral<"頭（防）">, z.ZodLiteral<"胴（防）">, z.ZodLiteral<"手（防）">, z.ZodLiteral<"腰（防）">, z.ZodLiteral<"肩（防）">, z.ZodLiteral<"パンツ（防）">, z.ZodLiteral<"靴（防）">, z.ZodLiteral<"頭（装）">, z.ZodLiteral<"顔（装）">, z.ZodLiteral<"耳（装）">, z.ZodLiteral<"指（装）">, z.ZodLiteral<"胸（装）">, z.ZodLiteral<"背中（装）">, z.ZodLiteral<"腰（装）">];
export declare const defencePartsSchema: z.ZodUnion<readonly [z.ZodLiteral<"頭（防）">, z.ZodLiteral<"胴（防）">, z.ZodLiteral<"手（防）">, z.ZodLiteral<"腰（防）">, z.ZodLiteral<"肩（防）">, z.ZodLiteral<"パンツ（防）">, z.ZodLiteral<"靴（防）">, z.ZodLiteral<"頭（装）">, z.ZodLiteral<"顔（装）">, z.ZodLiteral<"耳（装）">, z.ZodLiteral<"指（装）">, z.ZodLiteral<"胸（装）">, z.ZodLiteral<"背中（装）">, z.ZodLiteral<"腰（装）">]>;
export type DefencePart = z.infer<typeof defencePartsSchema>;
export declare const ItemBaseSchema: z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    buff: z.ZodOptional<z.ZodString>;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
}, "strip", z.ZodTypeAny, {
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    buff?: string | undefined;
}, {
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    buff?: string | undefined;
}>;
export type ItemBase = z.infer<typeof ItemBaseSchema>;
export declare const defenceItemSchema: z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    buff: z.ZodOptional<z.ZodString>;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
} & {
    type: z.ZodLiteral<"defences">;
    part: z.ZodUnion<readonly [z.ZodLiteral<"頭（防）">, z.ZodLiteral<"胴（防）">, z.ZodLiteral<"手（防）">, z.ZodLiteral<"腰（防）">, z.ZodLiteral<"肩（防）">, z.ZodLiteral<"パンツ（防）">, z.ZodLiteral<"靴（防）">, z.ZodLiteral<"頭（装）">, z.ZodLiteral<"顔（装）">, z.ZodLiteral<"耳（装）">, z.ZodLiteral<"指（装）">, z.ZodLiteral<"胸（装）">, z.ZodLiteral<"背中（装）">, z.ZodLiteral<"腰（装）">]>;
    armorClass: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodLiteral<"着こなし">;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "着こなし";
    }, {
        value: number;
        weapon: "着こなし";
    }>, "many">;
}, "strip", z.ZodTypeAny, {
    type: "defences";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "頭（防）" | "胴（防）" | "手（防）" | "腰（防）" | "肩（防）" | "パンツ（防）" | "靴（防）" | "頭（装）" | "顔（装）" | "耳（装）" | "指（装）" | "胸（装）" | "背中（装）" | "腰（装）";
    armorClass: number;
    skills: {
        value: number;
        weapon: "着こなし";
    }[];
    buff?: string | undefined;
}, {
    type: "defences";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "頭（防）" | "胴（防）" | "手（防）" | "腰（防）" | "肩（防）" | "パンツ（防）" | "靴（防）" | "頭（装）" | "顔（装）" | "耳（装）" | "指（装）" | "胸（装）" | "背中（装）" | "腰（装）";
    armorClass: number;
    skills: {
        value: number;
        weapon: "着こなし";
    }[];
    buff?: string | undefined;
}>;
export type InjectBuff<T> = T extends ItemBase ? Omit<T, "buff"> & {
    buff?: Buff;
} : T;
export type DefenceItem = z.infer<typeof defenceItemSchema>;
export declare const WEAPON_PARTS: readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">];
export declare const weaponPartsSchema: z.ZodUnion<readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">]>;
export type WeaponPart = z.infer<typeof weaponPartsSchema>;
export declare const weaponItemSchema: z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    buff: z.ZodOptional<z.ZodString>;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
} & {
    type: z.ZodLiteral<"weapons">;
    parts: z.ZodArray<z.ZodUnion<readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">]>, "many">;
    both: z.ZodOptional<z.ZodBoolean>;
    damage: z.ZodNumber;
    attackDelay: z.ZodNumber;
    attackRange: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodUnion<readonly [z.ZodLiteral<"筋力">, z.ZodLiteral<"着こなし">, z.ZodLiteral<"攻撃回避">, z.ZodLiteral<"生命力">, z.ZodLiteral<"知能">, z.ZodLiteral<"持久力">, z.ZodLiteral<"精神力">, z.ZodLiteral<"集中力">, z.ZodLiteral<"呪文抵抗">, ...(z.ZodLiteral<"落下耐性"> | z.ZodLiteral<"水泳"> | z.ZodLiteral<"死体回収"> | z.ZodLiteral<"包帯"> | z.ZodLiteral<"自然回復"> | z.ZodLiteral<"採掘"> | z.ZodLiteral<"伐採"> | z.ZodLiteral<"収穫"> | z.ZodLiteral<"釣り"> | z.ZodLiteral<"解読">)[], z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">]>;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }, {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }>, "many">;
}, "strip", z.ZodTypeAny, {
    type: "weapons";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    skills: {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }[];
    parts: ("右手" | "左手")[];
    damage: number;
    attackDelay: number;
    attackRange: number;
    buff?: string | undefined;
    both?: boolean | undefined;
}, {
    type: "weapons";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    skills: {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }[];
    parts: ("右手" | "左手")[];
    damage: number;
    attackDelay: number;
    attackRange: number;
    buff?: string | undefined;
    both?: boolean | undefined;
}>;
export type WeaponItem = z.infer<typeof weaponItemSchema>;
export declare const shieldItemSchema: z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    buff: z.ZodOptional<z.ZodString>;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
} & {
    type: z.ZodLiteral<"shields">;
    part: z.ZodUnion<readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">]>;
    armorClass: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodLiteral<"盾">;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "盾";
    }, {
        value: number;
        weapon: "盾";
    }>, "many">;
    avoidance: z.ZodNumber;
}, "strip", z.ZodTypeAny, {
    type: "shields";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "右手" | "左手";
    armorClass: number;
    skills: {
        value: number;
        weapon: "盾";
    }[];
    avoidance: number;
    buff?: string | undefined;
}, {
    type: "shields";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "右手" | "左手";
    armorClass: number;
    skills: {
        value: number;
        weapon: "盾";
    }[];
    avoidance: number;
    buff?: string | undefined;
}>;
export type ShieldItem = z.infer<typeof shieldItemSchema>;
export declare const itemSchema: z.ZodUnion<[z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    buff: z.ZodOptional<z.ZodString>;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
} & {
    type: z.ZodLiteral<"defences">;
    part: z.ZodUnion<readonly [z.ZodLiteral<"頭（防）">, z.ZodLiteral<"胴（防）">, z.ZodLiteral<"手（防）">, z.ZodLiteral<"腰（防）">, z.ZodLiteral<"肩（防）">, z.ZodLiteral<"パンツ（防）">, z.ZodLiteral<"靴（防）">, z.ZodLiteral<"頭（装）">, z.ZodLiteral<"顔（装）">, z.ZodLiteral<"耳（装）">, z.ZodLiteral<"指（装）">, z.ZodLiteral<"胸（装）">, z.ZodLiteral<"背中（装）">, z.ZodLiteral<"腰（装）">]>;
    armorClass: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodLiteral<"着こなし">;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "着こなし";
    }, {
        value: number;
        weapon: "着こなし";
    }>, "many">;
}, "strip", z.ZodTypeAny, {
    type: "defences";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "頭（防）" | "胴（防）" | "手（防）" | "腰（防）" | "肩（防）" | "パンツ（防）" | "靴（防）" | "頭（装）" | "顔（装）" | "耳（装）" | "指（装）" | "胸（装）" | "背中（装）" | "腰（装）";
    armorClass: number;
    skills: {
        value: number;
        weapon: "着こなし";
    }[];
    buff?: string | undefined;
}, {
    type: "defences";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "頭（防）" | "胴（防）" | "手（防）" | "腰（防）" | "肩（防）" | "パンツ（防）" | "靴（防）" | "頭（装）" | "顔（装）" | "耳（装）" | "指（装）" | "胸（装）" | "背中（装）" | "腰（装）";
    armorClass: number;
    skills: {
        value: number;
        weapon: "着こなし";
    }[];
    buff?: string | undefined;
}>, z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    buff: z.ZodOptional<z.ZodString>;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
} & {
    type: z.ZodLiteral<"weapons">;
    parts: z.ZodArray<z.ZodUnion<readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">]>, "many">;
    both: z.ZodOptional<z.ZodBoolean>;
    damage: z.ZodNumber;
    attackDelay: z.ZodNumber;
    attackRange: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodUnion<readonly [z.ZodLiteral<"筋力">, z.ZodLiteral<"着こなし">, z.ZodLiteral<"攻撃回避">, z.ZodLiteral<"生命力">, z.ZodLiteral<"知能">, z.ZodLiteral<"持久力">, z.ZodLiteral<"精神力">, z.ZodLiteral<"集中力">, z.ZodLiteral<"呪文抵抗">, ...(z.ZodLiteral<"落下耐性"> | z.ZodLiteral<"水泳"> | z.ZodLiteral<"死体回収"> | z.ZodLiteral<"包帯"> | z.ZodLiteral<"自然回復"> | z.ZodLiteral<"採掘"> | z.ZodLiteral<"伐採"> | z.ZodLiteral<"収穫"> | z.ZodLiteral<"釣り"> | z.ZodLiteral<"解読">)[], z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">]>;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }, {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }>, "many">;
}, "strip", z.ZodTypeAny, {
    type: "weapons";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    skills: {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }[];
    parts: ("右手" | "左手")[];
    damage: number;
    attackDelay: number;
    attackRange: number;
    buff?: string | undefined;
    both?: boolean | undefined;
}, {
    type: "weapons";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    skills: {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }[];
    parts: ("右手" | "左手")[];
    damage: number;
    attackDelay: number;
    attackRange: number;
    buff?: string | undefined;
    both?: boolean | undefined;
}>, z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    buff: z.ZodOptional<z.ZodString>;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
} & {
    type: z.ZodLiteral<"shields">;
    part: z.ZodUnion<readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">]>;
    armorClass: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodLiteral<"盾">;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "盾";
    }, {
        value: number;
        weapon: "盾";
    }>, "many">;
    avoidance: z.ZodNumber;
}, "strip", z.ZodTypeAny, {
    type: "shields";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "右手" | "左手";
    armorClass: number;
    skills: {
        value: number;
        weapon: "盾";
    }[];
    avoidance: number;
    buff?: string | undefined;
}, {
    type: "shields";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "右手" | "左手";
    armorClass: number;
    skills: {
        value: number;
        weapon: "盾";
    }[];
    avoidance: number;
    buff?: string | undefined;
}>]>;
export type Item = DefenceItem | WeaponItem | ShieldItem;
export declare const itemSchemaWithBuff: z.ZodUnion<[z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
    type: z.ZodLiteral<"defences">;
    part: z.ZodUnion<readonly [z.ZodLiteral<"頭（防）">, z.ZodLiteral<"胴（防）">, z.ZodLiteral<"手（防）">, z.ZodLiteral<"腰（防）">, z.ZodLiteral<"肩（防）">, z.ZodLiteral<"パンツ（防）">, z.ZodLiteral<"靴（防）">, z.ZodLiteral<"頭（装）">, z.ZodLiteral<"顔（装）">, z.ZodLiteral<"耳（装）">, z.ZodLiteral<"指（装）">, z.ZodLiteral<"胸（装）">, z.ZodLiteral<"背中（装）">, z.ZodLiteral<"腰（装）">]>;
    armorClass: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodLiteral<"着こなし">;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "着こなし";
    }, {
        value: number;
        weapon: "着こなし";
    }>, "many">;
} & {
    buff: z.ZodOptional<z.ZodUnion<[z.ZodObject<{
        name: z.ZodString;
        description: z.ZodString;
        unedited: z.ZodLiteral<true>;
        effects: z.ZodOptional<z.ZodArray<z.ZodNever, "many">>;
    }, "strip", z.ZodTypeAny, {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    }, {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    }>, z.ZodObject<{
        name: z.ZodString;
        description: z.ZodString;
        unedited: z.ZodOptional<z.ZodLiteral<false>>;
        noBuffSlot: z.ZodOptional<z.ZodBoolean>;
        effects: z.ZodArray<z.ZodUnion<[z.ZodObject<{
            type: z.ZodLiteral<"statusUp">;
            subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
            value: z.ZodUnion<[z.ZodNumber, z.ZodLiteral<"未検証">]>;
            group: z.ZodOptional<z.ZodString>;
            numberType: z.ZodOptional<z.ZodEnum<["percent"]>>;
        }, "strip", z.ZodTypeAny, {
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        }, {
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"others">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "others";
            subject: string;
        }, {
            type: "others";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"transform">;
            subject: z.ZodString;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "transform";
            subject: string;
            description?: string | undefined;
        }, {
            type: "transform";
            subject: string;
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"standMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "standMotionChange";
            description?: string | undefined;
        }, {
            type: "standMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"moveMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "moveMotionChange";
            description?: string | undefined;
        }, {
            type: "moveMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"recovery">;
            subject: z.ZodUnion<[z.ZodLiteral<"MP">, z.ZodLiteral<"HP">, z.ZodLiteral<"SP">]>;
            value: z.ZodNumber;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        }, {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"costRatio">;
            subject: z.ZodUnion<[z.ZodLiteral<"MP">, z.ZodLiteral<"HP">, z.ZodLiteral<"SP">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        }, {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"delayCut">;
            subject: z.ZodUnion<[z.ZodLiteral<"筋力">, z.ZodLiteral<"着こなし">, z.ZodLiteral<"攻撃回避">, z.ZodLiteral<"生命力">, z.ZodLiteral<"知能">, z.ZodLiteral<"持久力">, z.ZodLiteral<"精神力">, z.ZodLiteral<"集中力">, z.ZodLiteral<"呪文抵抗">, ...(z.ZodLiteral<"落下耐性"> | z.ZodLiteral<"水泳"> | z.ZodLiteral<"死体回収"> | z.ZodLiteral<"包帯"> | z.ZodLiteral<"自然回復"> | z.ZodLiteral<"採掘"> | z.ZodLiteral<"伐採"> | z.ZodLiteral<"収穫"> | z.ZodLiteral<"釣り"> | z.ZodLiteral<"解読">)[], z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">, z.ZodLiteral<"アイテム使用">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        }, {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"manufacture">;
            subject: z.ZodUnion<[z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">, z.ZodLiteral<"全生産">]>;
            process: z.ZodUnion<readonly [z.ZodLiteral<"ゲージ滑り">, z.ZodLiteral<"ゲージ速度">, z.ZodLiteral<"ヒットゾーン">, z.ZodLiteral<"グレードゾーン">, z.ZodLiteral<"マスターグレードゾーン">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        }, {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"technique">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "technique";
            subject: string;
        }, {
            type: "technique";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"followAttack">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "followAttack";
            subject: string;
        }, {
            type: "followAttack";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"techniqueMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "techniqueMotionChange";
            description?: string | undefined;
        }, {
            type: "techniqueMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"prevent">;
            subject: z.ZodUnion<[z.ZodLiteral<"満腹度減少">, z.ZodLiteral<"潤喉度減少">, z.ZodLiteral<"水中呼吸減少">, z.ZodLiteral<"ペット死亡時忠誠減少">, z.ZodLiteral<"ステータス減少">, z.ZodLiteral<"毒">, z.ZodLiteral<"病気">, z.ZodLiteral<"魔法攻撃">, z.ZodLiteral<"物理攻撃">]>;
            ratio: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        }, {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"damageUp">;
            subject: z.ZodUnion<[z.ZodLiteral<"悪魔">, z.ZodLiteral<"巨人">, z.ZodLiteral<"鳥">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        }, {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"reflection">;
            subject: z.ZodUnion<[z.ZodLiteral<"物理攻撃">, z.ZodLiteral<"魔法攻撃">]>;
            ratio: z.ZodNumber;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        }, {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"buffAssign">;
            trigger: z.ZodLiteral<"被ダメージ">;
            buffSubject: z.ZodString;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        }, {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"prohibit">;
            subject: z.ZodUnion<[z.ZodLiteral<"移動">, z.ZodLiteral<"テクニック">]>;
        }, "strip", z.ZodTypeAny, {
            type: "prohibit";
            subject: "移動" | "テクニック";
        }, {
            type: "prohibit";
            subject: "移動" | "テクニック";
        }>, z.ZodUnion<[z.ZodObject<{
            type: z.ZodLiteral<"friendship">;
            all: z.ZodLiteral<true>;
        }, "strip", z.ZodTypeAny, {
            type: "friendship";
            all: true;
        }, {
            type: "friendship";
            all: true;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"friendship">;
            all: z.ZodOptional<z.ZodLiteral<false>>;
            subject: z.ZodArray<z.ZodOptional<z.ZodUnion<[z.ZodLiteral<"獣">, z.ZodLiteral<"鳥">]>>, "many">;
        }, "strip", z.ZodTypeAny, {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        }, {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        }>]>]>, "many">;
    }, "strip", z.ZodTypeAny, {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    }, {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    }>]>>;
}, "strip", z.ZodTypeAny, {
    type: "defences";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "頭（防）" | "胴（防）" | "手（防）" | "腰（防）" | "肩（防）" | "パンツ（防）" | "靴（防）" | "頭（装）" | "顔（装）" | "耳（装）" | "指（装）" | "胸（装）" | "背中（装）" | "腰（装）";
    armorClass: number;
    skills: {
        value: number;
        weapon: "着こなし";
    }[];
    buff?: {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    } | {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    } | undefined;
}, {
    type: "defences";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "頭（防）" | "胴（防）" | "手（防）" | "腰（防）" | "肩（防）" | "パンツ（防）" | "靴（防）" | "頭（装）" | "顔（装）" | "耳（装）" | "指（装）" | "胸（装）" | "背中（装）" | "腰（装）";
    armorClass: number;
    skills: {
        value: number;
        weapon: "着こなし";
    }[];
    buff?: {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    } | {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    } | undefined;
}>, z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
    type: z.ZodLiteral<"weapons">;
    parts: z.ZodArray<z.ZodUnion<readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">]>, "many">;
    both: z.ZodOptional<z.ZodBoolean>;
    damage: z.ZodNumber;
    attackDelay: z.ZodNumber;
    attackRange: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodUnion<readonly [z.ZodLiteral<"筋力">, z.ZodLiteral<"着こなし">, z.ZodLiteral<"攻撃回避">, z.ZodLiteral<"生命力">, z.ZodLiteral<"知能">, z.ZodLiteral<"持久力">, z.ZodLiteral<"精神力">, z.ZodLiteral<"集中力">, z.ZodLiteral<"呪文抵抗">, ...(z.ZodLiteral<"落下耐性"> | z.ZodLiteral<"水泳"> | z.ZodLiteral<"死体回収"> | z.ZodLiteral<"包帯"> | z.ZodLiteral<"自然回復"> | z.ZodLiteral<"採掘"> | z.ZodLiteral<"伐採"> | z.ZodLiteral<"収穫"> | z.ZodLiteral<"釣り"> | z.ZodLiteral<"解読">)[], z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">]>;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }, {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }>, "many">;
} & {
    buff: z.ZodOptional<z.ZodUnion<[z.ZodObject<{
        name: z.ZodString;
        description: z.ZodString;
        unedited: z.ZodLiteral<true>;
        effects: z.ZodOptional<z.ZodArray<z.ZodNever, "many">>;
    }, "strip", z.ZodTypeAny, {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    }, {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    }>, z.ZodObject<{
        name: z.ZodString;
        description: z.ZodString;
        unedited: z.ZodOptional<z.ZodLiteral<false>>;
        noBuffSlot: z.ZodOptional<z.ZodBoolean>;
        effects: z.ZodArray<z.ZodUnion<[z.ZodObject<{
            type: z.ZodLiteral<"statusUp">;
            subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
            value: z.ZodUnion<[z.ZodNumber, z.ZodLiteral<"未検証">]>;
            group: z.ZodOptional<z.ZodString>;
            numberType: z.ZodOptional<z.ZodEnum<["percent"]>>;
        }, "strip", z.ZodTypeAny, {
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        }, {
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"others">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "others";
            subject: string;
        }, {
            type: "others";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"transform">;
            subject: z.ZodString;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "transform";
            subject: string;
            description?: string | undefined;
        }, {
            type: "transform";
            subject: string;
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"standMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "standMotionChange";
            description?: string | undefined;
        }, {
            type: "standMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"moveMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "moveMotionChange";
            description?: string | undefined;
        }, {
            type: "moveMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"recovery">;
            subject: z.ZodUnion<[z.ZodLiteral<"MP">, z.ZodLiteral<"HP">, z.ZodLiteral<"SP">]>;
            value: z.ZodNumber;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        }, {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"costRatio">;
            subject: z.ZodUnion<[z.ZodLiteral<"MP">, z.ZodLiteral<"HP">, z.ZodLiteral<"SP">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        }, {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"delayCut">;
            subject: z.ZodUnion<[z.ZodLiteral<"筋力">, z.ZodLiteral<"着こなし">, z.ZodLiteral<"攻撃回避">, z.ZodLiteral<"生命力">, z.ZodLiteral<"知能">, z.ZodLiteral<"持久力">, z.ZodLiteral<"精神力">, z.ZodLiteral<"集中力">, z.ZodLiteral<"呪文抵抗">, ...(z.ZodLiteral<"落下耐性"> | z.ZodLiteral<"水泳"> | z.ZodLiteral<"死体回収"> | z.ZodLiteral<"包帯"> | z.ZodLiteral<"自然回復"> | z.ZodLiteral<"採掘"> | z.ZodLiteral<"伐採"> | z.ZodLiteral<"収穫"> | z.ZodLiteral<"釣り"> | z.ZodLiteral<"解読">)[], z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">, z.ZodLiteral<"アイテム使用">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        }, {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"manufacture">;
            subject: z.ZodUnion<[z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">, z.ZodLiteral<"全生産">]>;
            process: z.ZodUnion<readonly [z.ZodLiteral<"ゲージ滑り">, z.ZodLiteral<"ゲージ速度">, z.ZodLiteral<"ヒットゾーン">, z.ZodLiteral<"グレードゾーン">, z.ZodLiteral<"マスターグレードゾーン">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        }, {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"technique">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "technique";
            subject: string;
        }, {
            type: "technique";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"followAttack">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "followAttack";
            subject: string;
        }, {
            type: "followAttack";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"techniqueMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "techniqueMotionChange";
            description?: string | undefined;
        }, {
            type: "techniqueMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"prevent">;
            subject: z.ZodUnion<[z.ZodLiteral<"満腹度減少">, z.ZodLiteral<"潤喉度減少">, z.ZodLiteral<"水中呼吸減少">, z.ZodLiteral<"ペット死亡時忠誠減少">, z.ZodLiteral<"ステータス減少">, z.ZodLiteral<"毒">, z.ZodLiteral<"病気">, z.ZodLiteral<"魔法攻撃">, z.ZodLiteral<"物理攻撃">]>;
            ratio: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        }, {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"damageUp">;
            subject: z.ZodUnion<[z.ZodLiteral<"悪魔">, z.ZodLiteral<"巨人">, z.ZodLiteral<"鳥">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        }, {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"reflection">;
            subject: z.ZodUnion<[z.ZodLiteral<"物理攻撃">, z.ZodLiteral<"魔法攻撃">]>;
            ratio: z.ZodNumber;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        }, {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"buffAssign">;
            trigger: z.ZodLiteral<"被ダメージ">;
            buffSubject: z.ZodString;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        }, {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"prohibit">;
            subject: z.ZodUnion<[z.ZodLiteral<"移動">, z.ZodLiteral<"テクニック">]>;
        }, "strip", z.ZodTypeAny, {
            type: "prohibit";
            subject: "移動" | "テクニック";
        }, {
            type: "prohibit";
            subject: "移動" | "テクニック";
        }>, z.ZodUnion<[z.ZodObject<{
            type: z.ZodLiteral<"friendship">;
            all: z.ZodLiteral<true>;
        }, "strip", z.ZodTypeAny, {
            type: "friendship";
            all: true;
        }, {
            type: "friendship";
            all: true;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"friendship">;
            all: z.ZodOptional<z.ZodLiteral<false>>;
            subject: z.ZodArray<z.ZodOptional<z.ZodUnion<[z.ZodLiteral<"獣">, z.ZodLiteral<"鳥">]>>, "many">;
        }, "strip", z.ZodTypeAny, {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        }, {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        }>]>]>, "many">;
    }, "strip", z.ZodTypeAny, {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    }, {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    }>]>>;
}, "strip", z.ZodTypeAny, {
    type: "weapons";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    skills: {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }[];
    parts: ("右手" | "左手")[];
    damage: number;
    attackDelay: number;
    attackRange: number;
    buff?: {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    } | {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    } | undefined;
    both?: boolean | undefined;
}, {
    type: "weapons";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    skills: {
        value: number;
        weapon: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容";
    }[];
    parts: ("右手" | "左手")[];
    damage: number;
    attackDelay: number;
    attackRange: number;
    buff?: {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    } | {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    } | undefined;
    both?: boolean | undefined;
}>, z.ZodObject<{
    id: z.ZodNumber;
    name: z.ZodString;
    description: z.ZodString;
    specials: z.ZodArray<z.ZodString, "many">;
    effects: z.ZodArray<z.ZodObject<{
        subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
        value: z.ZodNumber;
        numberType: z.ZodOptional<z.ZodLiteral<"percent">>;
    }, "strip", z.ZodTypeAny, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }, {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }>, "many">;
    genderAvailable: z.ZodUnion<[z.ZodLiteral<"男">, z.ZodLiteral<"女">, z.ZodLiteral<"ALL">]>;
    tribeAvailable: z.ZodUnion<[z.ZodLiteral<"パンデモス">, z.ZodLiteral<"ニューター">, z.ZodLiteral<"エルモニー">, z.ZodLiteral<"コグニート">, z.ZodLiteral<"ALL">]>;
    shipAvailable: z.ZodString;
    type: z.ZodLiteral<"shields">;
    part: z.ZodUnion<readonly [z.ZodLiteral<"右手">, z.ZodLiteral<"左手">]>;
    armorClass: z.ZodNumber;
    skills: z.ZodArray<z.ZodObject<{
        weapon: z.ZodLiteral<"盾">;
        value: z.ZodNumber;
    }, "strip", z.ZodTypeAny, {
        value: number;
        weapon: "盾";
    }, {
        value: number;
        weapon: "盾";
    }>, "many">;
    avoidance: z.ZodNumber;
} & {
    buff: z.ZodOptional<z.ZodUnion<[z.ZodObject<{
        name: z.ZodString;
        description: z.ZodString;
        unedited: z.ZodLiteral<true>;
        effects: z.ZodOptional<z.ZodArray<z.ZodNever, "many">>;
    }, "strip", z.ZodTypeAny, {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    }, {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    }>, z.ZodObject<{
        name: z.ZodString;
        description: z.ZodString;
        unedited: z.ZodOptional<z.ZodLiteral<false>>;
        noBuffSlot: z.ZodOptional<z.ZodBoolean>;
        effects: z.ZodArray<z.ZodUnion<[z.ZodObject<{
            type: z.ZodLiteral<"statusUp">;
            subject: z.ZodUnion<readonly [z.ZodLiteral<"攻撃力">, z.ZodLiteral<"命中">, z.ZodLiteral<"物理与ダメージ率">, z.ZodLiteral<"魔法与ダメージ率">, z.ZodLiteral<"魔法ディレイ">, z.ZodLiteral<"クリティカル率">, z.ZodLiteral<"魔力">, z.ZodLiteral<"スペル短縮">, z.ZodLiteral<"攻撃ディレイ">, z.ZodLiteral<"最大HP">, z.ZodLiteral<"最大MP">, z.ZodLiteral<"最大ST">, z.ZodLiteral<"防御力">, z.ZodLiteral<"回避">, z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"ペット経験値率">, z.ZodLiteral<"火属性効果率">, z.ZodLiteral<"水属性効果率">, z.ZodLiteral<"土属性効果率">, z.ZodLiteral<"風属性効果率">, z.ZodLiteral<"無属性効果率">, z.ZodLiteral<"HP自然回復">, z.ZodLiteral<"ST自然回復">, z.ZodLiteral<"MP自然回復">, z.ZodLiteral<"移動速度">, z.ZodLiteral<"水中速度">, z.ZodLiteral<"耐全属性">, z.ZodLiteral<"耐火属性">, z.ZodLiteral<"耐水属性">, z.ZodLiteral<"耐地属性">, z.ZodLiteral<"耐風属性">, z.ZodLiteral<"耐無属性">, z.ZodLiteral<"SEEING">, z.ZodLiteral<"HEARING">, z.ZodLiteral<"SMELLING">, z.ZodLiteral<"最大重量">, z.ZodLiteral<"所持重量">, z.ZodLiteral<"ジャンプ力率">, z.ZodLiteral<"落下速度率">, z.ZodLiteral<"落下ダメージ率">, z.ZodLiteral<"BREATH">, ...z.ZodLiteral<"料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン">[], z.ZodLiteral<"キック命中率補正">, z.ZodLiteral<"キック攻撃力補正">, z.ZodLiteral<"釣りゲージ速度">, z.ZodLiteral<"釣りヒットゾーン">, z.ZodLiteral<"釣りゲージ長">, z.ZodLiteral<"泳ぎ速度">, z.ZodLiteral<"牙命中率補正">, z.ZodLiteral<"牙攻撃補正">, z.ZodLiteral<"栽培ゲージ速度">, z.ZodLiteral<"盗み補正">, z.ZodLiteral<"潤喉度">, z.ZodLiteral<"満腹度">, z.ZodLiteral<"ピッキング失敗回数補正">, z.ZodLiteral<"ピッキング回転速度補正">, z.ZodLiteral<"攻撃範囲増加">, z.ZodLiteral<"詠唱継続率">, z.ZodLiteral<"伐採命中">, z.ZodLiteral<"サイズ">]>;
            value: z.ZodUnion<[z.ZodNumber, z.ZodLiteral<"未検証">]>;
            group: z.ZodOptional<z.ZodString>;
            numberType: z.ZodOptional<z.ZodEnum<["percent"]>>;
        }, "strip", z.ZodTypeAny, {
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        }, {
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"others">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "others";
            subject: string;
        }, {
            type: "others";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"transform">;
            subject: z.ZodString;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "transform";
            subject: string;
            description?: string | undefined;
        }, {
            type: "transform";
            subject: string;
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"standMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "standMotionChange";
            description?: string | undefined;
        }, {
            type: "standMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"moveMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "moveMotionChange";
            description?: string | undefined;
        }, {
            type: "moveMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"recovery">;
            subject: z.ZodUnion<[z.ZodLiteral<"MP">, z.ZodLiteral<"HP">, z.ZodLiteral<"SP">]>;
            value: z.ZodNumber;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        }, {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"costRatio">;
            subject: z.ZodUnion<[z.ZodLiteral<"MP">, z.ZodLiteral<"HP">, z.ZodLiteral<"SP">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        }, {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"delayCut">;
            subject: z.ZodUnion<[z.ZodLiteral<"筋力">, z.ZodLiteral<"着こなし">, z.ZodLiteral<"攻撃回避">, z.ZodLiteral<"生命力">, z.ZodLiteral<"知能">, z.ZodLiteral<"持久力">, z.ZodLiteral<"精神力">, z.ZodLiteral<"集中力">, z.ZodLiteral<"呪文抵抗">, ...(z.ZodLiteral<"落下耐性"> | z.ZodLiteral<"水泳"> | z.ZodLiteral<"死体回収"> | z.ZodLiteral<"包帯"> | z.ZodLiteral<"自然回復"> | z.ZodLiteral<"採掘"> | z.ZodLiteral<"伐採"> | z.ZodLiteral<"収穫"> | z.ZodLiteral<"釣り"> | z.ZodLiteral<"解読">)[], z.ZodLiteral<"素手">, z.ZodLiteral<"刀剣">, z.ZodLiteral<"こんぼう">, z.ZodLiteral<"槍">, z.ZodLiteral<"銃器">, z.ZodLiteral<"弓">, z.ZodLiteral<"盾">, z.ZodLiteral<"投げ">, z.ZodLiteral<"牙">, z.ZodLiteral<"罠">, z.ZodLiteral<"キック">, z.ZodLiteral<"戦闘技術">, z.ZodLiteral<"酩酊">, z.ZodLiteral<"物まね">, z.ZodLiteral<"調教">, z.ZodLiteral<"破壊">, z.ZodLiteral<"回復">, z.ZodLiteral<"神秘">, z.ZodLiteral<"召喚">, z.ZodLiteral<"強化">, z.ZodLiteral<"死魔">, z.ZodLiteral<"魔法熟練">, z.ZodLiteral<"自然調和">, z.ZodLiteral<"暗黒命令">, z.ZodLiteral<"取引">, z.ZodLiteral<"シャウト">, z.ZodLiteral<"音楽">, z.ZodLiteral<"盗み">, z.ZodLiteral<"ギャンブル">, z.ZodLiteral<"パフォーマンス">, z.ZodLiteral<"ダンス">, z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">, z.ZodLiteral<"アイテム使用">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        }, {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"manufacture">;
            subject: z.ZodUnion<[z.ZodLiteral<"料理">, z.ZodLiteral<"鍛冶">, z.ZodLiteral<"醸造">, z.ZodLiteral<"大工">, z.ZodLiteral<"裁縫">, z.ZodLiteral<"薬調合">, z.ZodLiteral<"装飾細工">, z.ZodLiteral<"複製">, z.ZodLiteral<"栽培">, z.ZodLiteral<"美容">, z.ZodLiteral<"全生産">]>;
            process: z.ZodUnion<readonly [z.ZodLiteral<"ゲージ滑り">, z.ZodLiteral<"ゲージ速度">, z.ZodLiteral<"ヒットゾーン">, z.ZodLiteral<"グレードゾーン">, z.ZodLiteral<"マスターグレードゾーン">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        }, {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"technique">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "technique";
            subject: string;
        }, {
            type: "technique";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"followAttack">;
            subject: z.ZodString;
        }, "strip", z.ZodTypeAny, {
            type: "followAttack";
            subject: string;
        }, {
            type: "followAttack";
            subject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"techniqueMotionChange">;
            description: z.ZodOptional<z.ZodString>;
        }, "strip", z.ZodTypeAny, {
            type: "techniqueMotionChange";
            description?: string | undefined;
        }, {
            type: "techniqueMotionChange";
            description?: string | undefined;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"prevent">;
            subject: z.ZodUnion<[z.ZodLiteral<"満腹度減少">, z.ZodLiteral<"潤喉度減少">, z.ZodLiteral<"水中呼吸減少">, z.ZodLiteral<"ペット死亡時忠誠減少">, z.ZodLiteral<"ステータス減少">, z.ZodLiteral<"毒">, z.ZodLiteral<"病気">, z.ZodLiteral<"魔法攻撃">, z.ZodLiteral<"物理攻撃">]>;
            ratio: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        }, {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"damageUp">;
            subject: z.ZodUnion<[z.ZodLiteral<"悪魔">, z.ZodLiteral<"巨人">, z.ZodLiteral<"鳥">]>;
            value: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        }, {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        }>, z.ZodObject<{
            type: z.ZodLiteral<"reflection">;
            subject: z.ZodUnion<[z.ZodLiteral<"物理攻撃">, z.ZodLiteral<"魔法攻撃">]>;
            ratio: z.ZodNumber;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        }, {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"buffAssign">;
            trigger: z.ZodLiteral<"被ダメージ">;
            buffSubject: z.ZodString;
            probability: z.ZodNumber;
        }, "strip", z.ZodTypeAny, {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        }, {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"prohibit">;
            subject: z.ZodUnion<[z.ZodLiteral<"移動">, z.ZodLiteral<"テクニック">]>;
        }, "strip", z.ZodTypeAny, {
            type: "prohibit";
            subject: "移動" | "テクニック";
        }, {
            type: "prohibit";
            subject: "移動" | "テクニック";
        }>, z.ZodUnion<[z.ZodObject<{
            type: z.ZodLiteral<"friendship">;
            all: z.ZodLiteral<true>;
        }, "strip", z.ZodTypeAny, {
            type: "friendship";
            all: true;
        }, {
            type: "friendship";
            all: true;
        }>, z.ZodObject<{
            type: z.ZodLiteral<"friendship">;
            all: z.ZodOptional<z.ZodLiteral<false>>;
            subject: z.ZodArray<z.ZodOptional<z.ZodUnion<[z.ZodLiteral<"獣">, z.ZodLiteral<"鳥">]>>, "many">;
        }, "strip", z.ZodTypeAny, {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        }, {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        }>]>]>, "many">;
    }, "strip", z.ZodTypeAny, {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    }, {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    }>]>>;
}, "strip", z.ZodTypeAny, {
    type: "shields";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "右手" | "左手";
    armorClass: number;
    skills: {
        value: number;
        weapon: "盾";
    }[];
    avoidance: number;
    buff?: {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    } | {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    } | undefined;
}, {
    type: "shields";
    description: string;
    name: string;
    effects: {
        value: number;
        subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
        numberType?: "percent" | undefined;
    }[];
    id: number;
    specials: string[];
    genderAvailable: "男" | "女" | "ALL";
    tribeAvailable: "ALL" | "パンデモス" | "ニューター" | "エルモニー" | "コグニート";
    shipAvailable: string;
    part: "右手" | "左手";
    armorClass: number;
    skills: {
        value: number;
        weapon: "盾";
    }[];
    avoidance: number;
    buff?: {
        description: string;
        name: string;
        unedited: true;
        effects?: never[] | undefined;
    } | {
        description: string;
        name: string;
        effects: ({
            value: number | "未検証";
            type: "statusUp";
            subject: "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "耐火属性" | "耐水属性" | "耐地属性" | "耐風属性" | "耐無属性" | "料理ゲージ滑り" | "料理ゲージ速度" | "料理ヒットゾーン" | "料理グレードゾーン" | "料理マスターグレードゾーン" | "鍛冶ゲージ滑り" | "鍛冶ゲージ速度" | "鍛冶ヒットゾーン" | "鍛冶グレードゾーン" | "鍛冶マスターグレードゾーン" | "醸造ゲージ滑り" | "醸造ゲージ速度" | "醸造ヒットゾーン" | "醸造グレードゾーン" | "醸造マスターグレードゾーン" | "大工ゲージ滑り" | "大工ゲージ速度" | "大工ヒットゾーン" | "大工グレードゾーン" | "大工マスターグレードゾーン" | "裁縫ゲージ滑り" | "裁縫ゲージ速度" | "裁縫ヒットゾーン" | "裁縫グレードゾーン" | "裁縫マスターグレードゾーン" | "薬調合ゲージ滑り" | "薬調合ゲージ速度" | "薬調合ヒットゾーン" | "薬調合グレードゾーン" | "薬調合マスターグレードゾーン" | "装飾細工ゲージ滑り" | "装飾細工ゲージ速度" | "装飾細工ヒットゾーン" | "装飾細工グレードゾーン" | "装飾細工マスターグレードゾーン" | "複製ゲージ滑り" | "複製ゲージ速度" | "複製ヒットゾーン" | "複製グレードゾーン" | "複製マスターグレードゾーン" | "栽培ゲージ滑り" | "栽培ゲージ速度" | "栽培ヒットゾーン" | "栽培グレードゾーン" | "栽培マスターグレードゾーン" | "美容ゲージ滑り" | "美容ゲージ速度" | "美容ヒットゾーン" | "美容グレードゾーン" | "美容マスターグレードゾーン" | "攻撃力" | "命中" | "物理与ダメージ率" | "魔法与ダメージ率" | "魔法ディレイ" | "クリティカル率" | "魔力" | "スペル短縮" | "攻撃ディレイ" | "最大HP" | "最大MP" | "最大ST" | "防御力" | "回避" | "ペット経験値率" | "火属性効果率" | "水属性効果率" | "土属性効果率" | "風属性効果率" | "無属性効果率" | "HP自然回復" | "ST自然回復" | "MP自然回復" | "移動速度" | "水中速度" | "耐全属性" | "SEEING" | "HEARING" | "SMELLING" | "最大重量" | "所持重量" | "ジャンプ力率" | "落下速度率" | "落下ダメージ率" | "BREATH" | "キック命中率補正" | "キック攻撃力補正" | "釣りゲージ速度" | "釣りヒットゾーン" | "釣りゲージ長" | "泳ぎ速度" | "牙命中率補正" | "牙攻撃補正" | "盗み補正" | "潤喉度" | "満腹度" | "ピッキング失敗回数補正" | "ピッキング回転速度補正" | "攻撃範囲増加" | "詠唱継続率" | "伐採命中" | "サイズ";
            numberType?: "percent" | undefined;
            group?: string | undefined;
        } | {
            type: "others";
            subject: string;
        } | {
            type: "transform";
            subject: string;
            description?: string | undefined;
        } | {
            type: "standMotionChange";
            description?: string | undefined;
        } | {
            type: "moveMotionChange";
            description?: string | undefined;
        } | {
            type: "techniqueMotionChange";
            description?: string | undefined;
        } | {
            value: number;
            type: "recovery";
            subject: "MP" | "HP" | "SP";
            probability: number;
        } | {
            value: number;
            type: "costRatio";
            subject: "MP" | "HP" | "SP";
        } | {
            value: number;
            type: "delayCut";
            subject: "筋力" | "着こなし" | "攻撃回避" | "生命力" | "知能" | "持久力" | "精神力" | "集中力" | "呪文抵抗" | "素手" | "刀剣" | "こんぼう" | "槍" | "銃器" | "弓" | "盾" | "投げ" | "牙" | "罠" | "キック" | "戦闘技術" | "酩酊" | "物まね" | "調教" | "破壊" | "回復" | "神秘" | "召喚" | "強化" | "死魔" | "魔法熟練" | "自然調和" | "暗黒命令" | "取引" | "シャウト" | "音楽" | "盗み" | "ギャンブル" | "パフォーマンス" | "ダンス" | "落下耐性" | "水泳" | "死体回収" | "包帯" | "自然回復" | "採掘" | "伐採" | "収穫" | "釣り" | "解読" | "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "アイテム使用";
        } | {
            value: number;
            type: "manufacture";
            subject: "料理" | "鍛冶" | "醸造" | "大工" | "裁縫" | "薬調合" | "装飾細工" | "複製" | "栽培" | "美容" | "全生産";
            process: "ゲージ滑り" | "ゲージ速度" | "ヒットゾーン" | "グレードゾーン" | "マスターグレードゾーン";
        } | {
            type: "technique";
            subject: string;
        } | {
            type: "followAttack";
            subject: string;
        } | {
            type: "prevent";
            subject: "満腹度減少" | "潤喉度減少" | "水中呼吸減少" | "ペット死亡時忠誠減少" | "ステータス減少" | "毒" | "病気" | "魔法攻撃" | "物理攻撃";
            ratio: number;
        } | {
            type: "reflection";
            subject: "魔法攻撃" | "物理攻撃";
            probability: number;
            ratio: number;
        } | {
            value: number;
            type: "damageUp";
            subject: "悪魔" | "巨人" | "鳥";
        } | {
            type: "buffAssign";
            probability: number;
            trigger: "被ダメージ";
            buffSubject: string;
        } | {
            type: "prohibit";
            subject: "移動" | "テクニック";
        } | {
            type: "friendship";
            all: true;
        } | {
            type: "friendship";
            subject: ("鳥" | "獣" | undefined)[];
            all?: false | undefined;
        })[];
        unedited?: false | undefined;
        noBuffSlot?: boolean | undefined;
    } | undefined;
}>]>;
export type ItemWithBuff = z.infer<typeof itemSchemaWithBuff>;
